# Exercise 2: Multiple-Row Subquery 
[โจทย์หน้า: 33](https://drive.google.com/drive/u/0/folders/1-ALfovQlpNBpBNqAo91g5dimx0NMDX_s)

## Load data

In [1]:
%load_ext sql
# Show more rows in results
%config SqlMagic.displaylimit = 300

In [2]:
%sql postgresql://postgres:12345678@localhost:5432/postgres

Connecting to 'postgresql://postgres:***@localhost:5432/postgres'

In [4]:
%sql SELECT version()

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

1 rows affected.

+-------------------------------------------------------------------------+
|                                 version                                 |
+-------------------------------------------------------------------------+
| PostgreSQL 18.1 on x86_64-windows, compiled by msvc-19.44.35221, 64-bit |
+-------------------------------------------------------------------------+

In [5]:
%sql SET search_path TO classicmodels, public

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

++
||
++
++

## Query

### 1. Customer Order Summary: Write a query to find the average number of orders per customer. First create a derived table that shows the `count of orders for each customer`, then calculate the average from that result.

สร้าง derived table แสดงจำนวน `order` ต่อ `customer` ลูกค้า 1คน ว่าแต่ละคนสั่งกี่ `order`

In [21]:
%%sql
SELECT 
    customerNumber,
    count(*) AS countorders
FROM orders
GROUP BY customerNumber
ORDER BY customerNumber ASC
LIMIT 5;

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

5 rows affected.

+----------------+-------------+
| customernumber | countorders |
+----------------+-------------+
|      103       |      3      |
|      112       |      3      |
|      114       |      5      |
|      119       |      4      |
|      121       |      4      |
+----------------+-------------+

นำค่าที่ count ได้มาคำนวนหา AVG

In [ ]:
#Solution
%%sql
SELECT
    AVG(countorders) AS average_orders
FROM
    (SELECT customerNumber,count(*) AS countorders
        FROM orders
        GROUP BY customerNumber
        ORDER BY customerNumber ASC
    )

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

1 rows affected.

+--------------------+
|   average_orders   |
+--------------------+
| 3.3265306122448980 |
+--------------------+

### 2. Top Product Lines by Revenue: Write a query to find `product lines` and their `total revenue`, then display only those product lines whose revenue is above 500,000. Use a subquery in the FROM clause to calculate revenue (quantityOrdered * priceEach) for each product line.

In [ ]:
# Solution
%%sql
SELECT  
    productLine, totalRevenue
FROM 
    (SELECT 
        productLine,
        SUM(quantityOrdered * priceEach) AS totalRevenue
    FROM products
    JOIN orderdetails USING (productCode)
    GROUP BY productLine
    )
WHERE totalRevenue > 500000

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

6 rows affected.

+------------------+--------------+
|   productline    | totalrevenue |
+------------------+--------------+
|   Classic Cars   |  3853922.49  |
|      Planes      |  954637.54   |
| Trucks and Buses |  1024113.57  |
|   Motorcycles    |  1121426.12  |
|   Vintage Cars   |  1797559.63  |
|      Ships       |  663998.34   |
+------------------+--------------+

### 3. Employee Office Summary: Write a query to show each `office’s city` along with the average number of customers handled by employees in that office. Use a derived table to first count customers per employee.

- สร้างตารางนับ customers per employee
- ข้อนี้ใน LEFT JOIN เพราะต้องการ 0 ไปคำนวนหา avg ด้วย
- ถ้า JOIN เฉยๆจะไม่เอา 0 มาคำนวนทำให้ค่า avg เพี้ยน

In [35]:
%%sql
SELECT e.officeCode, e.employeeNumber, COUNT(c.customerNumber) AS custCount
FROM employees e
LEFT JOIN customers c 
    ON e.employeeNumber = c.salesRepEmployeeNumber
GROUP BY e.officeCode, e.employeeNumber

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

23 rows affected.

+------------+----------------+-----------+
| officecode | employeenumber | custcount |
+------------+----------------+-----------+
|     1      |      1002      |     0     |
|     4      |      1102      |     0     |
|     6      |      1619      |     0     |
|     4      |      1370      |     7     |
|     4      |      1337      |     6     |
|     1      |      1056      |     0     |
|     4      |      1401      |     10    |
|     6      |      1611      |     5     |
|     6      |      1612      |     5     |
|     4      |      1702      |     6     |
|     7      |      1504      |     9     |
|     3      |      1286      |     7     |
|     1      |      1076      |     0     |
|     3      |      1323      |     8     |
|     2      |      1216      |     6     |
|     1      |      1166      |     6     |
|     5      |      1621      |     5     |
|     6      |      1088      |     0     |
|     2      |      1188      |     6     |
|     7      |      1501      |     8     |
|     1      |      1143      |     0     |
|     5      |      1625      |     0     |
|     1      |      1165      |     6     |
+------------+----------------+-----------+

In [ ]:
# Solution
%%sql
SELECT 
    o.city, 
    AVG(custCount) AS avgCustomersPerEmployee
FROM offices o
JOIN 
    (SELECT e.officeCode, e.employeeNumber, COUNT(c.customerNumber) AS custCount
        FROM employees e
        LEFT JOIN customers c ON e.employeeNumber = c.salesRepEmployeeNumber
        GROUP BY e.officeCode, e.employeeNumber
    ) AS empCustomers
ON o.officeCode = empCustomers.officeCode
GROUP BY o.city

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

7 rows affected.

+---------------+-------------------------+
|      city     | avgcustomersperemployee |
+---------------+-------------------------+
|     Paris     |    5.8000000000000000   |
|     Sydney    |    2.5000000000000000   |
|     Tokyo     |    2.5000000000000000   |
| San Francisco |    2.0000000000000000   |
|     Boston    |    6.0000000000000000   |
|     London    |    8.5000000000000000   |
|      NYC      |    7.5000000000000000   |
+---------------+-------------------------+

### 4. High-Value Orders: Write a query to find the `customer name` and `order number for orders` that have a `total value greater than 50,000`. Use a subquery in the FROM clause to calculate the total value (SUM of quantityOrdered * priceEach) for each order.

หารายชื่อของ `customer` ที่มียอด `order` รวมมากกว่า 50000 บาท
- ใน subquery จะได้รายชื่อของ `customer` และยอดรวมของ `order` ของลูกค้าคนนั้นๆ

In [58]:
%%sql
SELECT 
    ov.orderNumber,
    customerName,
    ov.orderTotal
FROM customers
JOIN
    (SELECT
        orderNumber, 
        customerNumber,
        SUM(quantityOrdered * priceEach) AS orderTotal
     FROM orders
        JOIN orderdetails USING (orderNumber)
     GROUP BY orderNumber, customerNumber
    ) AS ov
ON customers.customerNumber = ov.customerNumber
WHERE orderTotal > 50000

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

36 rows affected.

+-------------+------------------------------+------------+
| ordernumber |         customername         | ordertotal |
+-------------+------------------------------+------------+
|    10276    |   Online Mini Collectables   |  51152.86  |
|    10266    |     L'ordine Souveniers      |  51619.02  |
|    10145    |      Toys4GrownUps.com       |  50342.74  |
|    10168    |     Technics Stores Inc.     |  50743.65  |
|    10122    |     Marseille Mini Autos     |  50824.66  |
|    10314    |     Heintze Collectables     |  53745.34  |
|    10419    |    Salzburg Collectables     |  52420.07  |
|    10304    |         Auto Associ          |  53116.99  |
|    10329    |      Land of Toys Inc.       |  50025.35  |
|    10212    |    Euro+ Shopping Channel    |  59830.55  |
|    10336    |  La Corne D'abondance, Co.   |  51209.58  |
|    10127    |      Muscle Machine Inc      |  58841.35  |
|    10360    |      Kelly's Gift Shop       |  52166.00  |
|    10159    |   Corporate Gift Ideas Co.   |  54682.68  |
|    10390    | Mini Gifts Distributors Ltd. |  55902.50  |
|    10414    |      Gifts4AllAges.com       |  50806.85  |
|    10204    |      Muscle Machine Inc      |  58793.53  |
|    10407    |  The Sharp Gifts Warehouse   |  52229.55  |
|    10310    |        Toms Spezialit        |  61234.67  |
|    10105    |   Danish Wholesale Imports   |  53959.21  |
|    10165    |   Dragon Souveniers, Ltd.    |  67392.85  |
|    10192    | Online Diecast Creations Co. |  55425.77  |
|    10185    |     Mini Creations Ltd.      |  52548.49  |
|    10106    |        Rovelli Gifts         |  52151.81  |
|    10181    |         Herkku Gifts         |  55069.55  |
|    10306    |        AV Stores, Co.        |  52825.29  |
|    10126    |  Corrida Auto Replicas, Ltd  |  57131.92  |
|    10222    | Collectable Mini Designs Co. |  56822.65  |
|    10287    |       Vida Sport, Ltd        |  61402.00  |
|    10108    |       Cruz & Sons Co.        |  51001.22  |
|    10103    |      Baane Mini Imports      |  50218.95  |
|    10312    | Mini Gifts Distributors Ltd. |  55639.66  |
|    10322    | Online Diecast Creations Co. |  50799.69  |
|    10207    |     Diecast Collectables     |  59265.14  |
|    10135    | Mini Gifts Distributors Ltd. |  55601.84  |
|    10142    | Mini Gifts Distributors Ltd. |  56052.56  |
+-------------+------------------------------+------------+

### 5. Product Performance Ranking: Write a query to display `product codes`, `product names`, and their `total quantity ordered`. Then show only `products` that are in the `top 10` by quantity ordered. Use a derived table to calculate total quantities.

In [ ]:
%%sql
SELECT 
    productCode,
    productName,
    totalQuantityOrdered
FROM products
JOIN
    (SELECT 
        productCode,
        SUM(quantityOrdered) AS totalQuantityOrdered
     FROM orderdetails
     GROUP BY productCode
    ) AS od
# ON products.productCode = od.productCode # เพราะเรามั่นใจว่าใช้การเชื่อมด้วยคอลัมน์เดียวกันเลยใช้ USING แทน
USING (productCode)
ORDER BY totalQuantityOrdered DESC
LIMIT 10;

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

10 rows affected.

+-------------+-----------------------------------------+----------------------+
| productcode |               productname               | totalquantityordered |
+-------------+-----------------------------------------+----------------------+
|   S18_3232  |       1992 Ferrari 360 Spider red       |         1808         |
|   S18_1342  |           1937 Lincoln Berline          |         1111         |
|  S700_4002  |        American Airlines: MD-11S        |         1085         |
|   S18_3856  | 1941 Chevrolet Special Deluxe Cabriolet |         1076         |
|   S50_1341  |       1930 Buick Marquette Phaeton      |         1074         |
|   S18_4600  |             1940s Ford truck            |         1061         |
|   S10_1678  |  1969 Harley Davidson Ultimate Chopper  |         1057         |
|   S12_4473  |            1957 Chevy Pickup            |         1056         |
|   S18_2319  |          1964 Mercedes Tour Bus         |         1053         |
|   S24_3856  |         1956 Porsche 356A Coupe         |         1052         |
+-------------+-----------------------------------------+----------------------+